liebherrnenzing/canpie-fd_device/stm32/f4/hal/stm32f4xx_canpie-fd.c
#include "cp_core.h"
#include "cp_msg.h"
#include "canpie.h"

#include "stm32f4xx_hal.h"

// Definitions
#define HAL_CAN_TIMEOUT_VALUE  10U
#define MAX_CAN_FILTER_NUMBER	14
#define BUFFER_TX	(0)
#define BUFFER_RX	(1)
#define BUFFER_NOT_USED	(-1)
// external functions
// variables of module
extern CAN_HandleTypeDef hcan1;

static CanRxMsgTypeDef can_rx_msg_fifo0;
//static CanRxMsgTypeDef can_rx_msg_fifo1;
static CanTxMsgTypeDef can_tx_msg;

static uint8_t filter_to_cp_buffer[MAX_CAN_FILTER_NUMBER];
static uint8_t tx_mailbox_to_buffer[3];

#if CP_STATISTIC > 0
static uint32_t tx_counter;
static uint32_t rx_counter;
static uint32_t err_counter;
#endif

#define HCAN1 hcan1

struct hal_baudrate
{
	enum CpBitrate_e bitrate;
	uint32_t prescaler;
	uint32_t sjw;
	uint32_t bs1;
	uint32_t bs2;
};

enum DrvInfo_e
{
	eDRV_INFO_OFF = 0, eDRV_INFO_INIT, eDRV_INFO_ACTIVE
};

static const struct hal_baudrate hal_baudrate_timing_36mhz[] =
{
	{ eCP_BITRATE_10K, 225, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 10 KBit/s 87.5%
	{ eCP_BITRATE_20K, 100, CAN_SJW_1TQ, CAN_BS1_14TQ, CAN_BS2_3TQ }, // 20 KBit/s 83.3%
	{ eCP_BITRATE_50K, 45, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 50 KBit/s 87.5%
	{ eCP_BITRATE_100K, 20, CAN_SJW_1TQ, CAN_BS1_14TQ, CAN_BS2_3TQ }, // 100 KBit/s 83.3%
	{ eCP_BITRATE_125K, 18, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 125 KBit/s 87.5%
	{ eCP_BITRATE_250K, 9, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 250 KBit/s 87.5%
	{ eCP_BITRATE_500K, 4, CAN_SJW_1TQ, CAN_BS1_14TQ, CAN_BS2_3TQ }, // 500 KBit/s 83.3%
	{ eCP_BITRATE_800K, 3, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ }, // 800 KBit/s 86.7 %
	{ eCP_BITRATE_1M, 2, CAN_SJW_1TQ, CAN_BS1_14TQ, CAN_BS2_3TQ }  // 1 MBit/s 83.3%
};

#if 0
static const struct hal_baudrate hal_baudrate_timing_42mhz[] =
{
	{	eCP_BITRATE_10K, 280, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ}, // 10 KBit/s 86.7%
	{	eCP_BITRATE_20K, 140, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ}, // 20 KBit/s 86.7%
	{	eCP_BITRATE_50K, 56, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ}, // 50 KBit/s 86.7%
	{	eCP_BITRATE_100K, 28, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ}, // 100 KBit/s 86.7%
	{	eCP_BITRATE_125K, 21, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ}, // 125 KBit/s 87.5%
	{	eCP_BITRATE_250K, 12, CAN_SJW_1TQ, CAN_BS1_11TQ, CAN_BS2_2TQ}, // 250 KBit/s 85.7%
	{	eCP_BITRATE_500K, 6, CAN_SJW_1TQ, CAN_BS1_11TQ, CAN_BS2_2TQ}, // 500 KBit/s 85.7%
	{	eCP_BITRATE_1M, 3, CAN_SJW_1TQ, CAN_BS1_11TQ, CAN_BS2_2TQ}  // 1 MBit/s 85.7%
};
#endif

static const struct hal_baudrate hal_baudrate_timing_42mhz[] =
{
	{ eCP_BITRATE_10K, 200, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 10 KBit/s 76.19%
	{ eCP_BITRATE_20K, 100, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 20 KBit/s 76.19%
	{ eCP_BITRATE_50K, 40, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 50 KBit/s 76.19%
	{ eCP_BITRATE_100K, 20, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 100 KBit/s 76.19%
	{ eCP_BITRATE_125K, 16, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 125 KBit/s 76.19%
	{ eCP_BITRATE_250K, 8, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 250 KBit/s 76.19%
	{ eCP_BITRATE_500K, 4, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }, // 500 KBit/s 76.19%
	{ eCP_BITRATE_1M, 2, CAN_SJW_1TQ, CAN_BS1_15TQ, CAN_BS2_5TQ }  // 1 MBit/s 76.19%
};

static const struct hal_baudrate hal_baudrate_timing_48mhz[] =
{
	{ eCP_BITRATE_10K, 300, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 10 KBit/s 87.5%
	{ eCP_BITRATE_20K, 150, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 20 KBit/s 87.5%
	{ eCP_BITRATE_50K, 60, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 50 KBit/s 87.5%
	{ eCP_BITRATE_100K, 30, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 100 KBit/s 87.5%
	{ eCP_BITRATE_125K, 24, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 125 KBit/s 87.5%
	{ eCP_BITRATE_250K, 12, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 250 KBit/s 87.5%
	{ eCP_BITRATE_500K, 6, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }, // 500 KBit/s 87.5%
	{ eCP_BITRATE_800K, 4, CAN_SJW_1TQ, CAN_BS1_12TQ, CAN_BS2_2TQ }, // 800 KBit/s 86.7 %
	{ eCP_BITRATE_1M, 3, CAN_SJW_1TQ, CAN_BS1_13TQ, CAN_BS2_2TQ }  // 1 MBit/s 87.5%
};

//-------------------------------------------------------------------
// simulation of CAN message buffer
//
static CpCanMsg_ts atsCanMsgS[CP_BUFFER_MAX];
static CpFifo_ts * aptsFifoS[CP_BUFFER_MAX];
static uint32_t aulAccMaskS[CP_BUFFER_MAX];

static int8_t buffer_direction[CP_BUFFER_MAX]; // 0 tx, 1 rx, -1 not used

//-------------------------------------------------------------------
// these pointers store the callback handlers
//
static CpRcvHandler_Fn /*@null@*/pfnRcvHandlerS = CPP_NULL;
static CpTrmHandler_Fn /*@null@*/pfnTrmHandlerS = CPP_NULL;
static CpErrHandler_Fn /*@null@*/pfnErrHandlerS = CPP_NULL;

static CpStatus_tv get_next_free_filter_number(uint8_t *filter_number);
static HAL_StatusTypeDef can_filter_config(uint32_t ulIdentifierV, uint32_t ulAcceptMaskV, uint8_t ubFormatV, uint8_t filter_number,  uint32_t fifo, bool_t activate);
static CpStatus_tv can_filter_init(uint8_t ubBufferIdxV, uint32_t ulIdentifierV, uint32_t ulAcceptMaskV, uint8_t ubFormatV);
static CpStatus_tv can_filter_clear_all(void);
static CpStatus_tv search_for_already_defined_filter(uint8_t ubBufferIdxV, uint8_t *filter_number);

static HAL_StatusTypeDef HAL_CAN_Transmit_IT_MOD(CAN_HandleTypeDef* hcan, uint8_t ubBufferIdxV, uint8_t *used_tx_mailbox);

/*----------------------------------------------------------------------------*\
** Function implementation                                                    **
 **                                                                            **
 \*----------------------------------------------------------------------------*/
static CpStatus_tv CheckParam(const CpPort_ts * ptsPortV, const uint8_t ubBufferIdxV, const uint8_t unReqStateV)
{
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		tvStatusT = eCP_ERR_INIT_MISSING;

		//--------------------------------------------------------
		// check for initialisation
		//
		if (ptsPortV->ubDrvInfo >= unReqStateV)
		{
			tvStatusT = eCP_ERR_BUFFER;

