liebherrnenzing/canpie-fd_device/stm32/f4/hal/stm32f4xx_canpie-fd.c
	for (i = 0; i < MAX_CAN_FILTER_NUMBER; ++i)
	{
		if (filter_to_cp_buffer[i] == 0)
		{
			*filter_number = i;
			return eCP_ERR_NONE;
		}
	}

	return eCP_ERR_INIT_FAIL;
}

/**
 * @param ubBufferIdxV
 * @param filter_number
 * @return
 */
static CpStatus_tv search_for_already_defined_filter(uint8_t ubBufferIdxV, uint8_t *filter_number)
{
	uint8_t i;

	for (i = 0; i < MAX_CAN_FILTER_NUMBER; ++i)
	{
		if (filter_to_cp_buffer[i] == ubBufferIdxV)
		{
			*filter_number = i;
			return eCP_ERR_NONE;
		}
	}
	return eCP_ERR_INIT_FAIL;
}

/**
 * @param ubBufferIdxV
 * @param ulIdentifierV
 * @param ulAcceptMaskV
 * @param ubFormatV
 * @return
 */
static CpStatus_tv can_filter_init(uint8_t ubBufferIdxV, uint32_t ulIdentifierV, uint32_t ulAcceptMaskV, uint8_t ubFormatV)
{
	CpStatus_tv status;
	uint8_t filter_number;
	HAL_StatusTypeDef hal_status;
	static uint32_t fifo_number = CAN_FIFO0;

	// check if the buffer is already defined to a filter
	status = search_for_already_defined_filter(ubBufferIdxV, &filter_number);
	// it is not really nice but I use the status to check if a filter exists or not
	if (eCP_ERR_INIT_FAIL == status)
	{
		// there is no filter assigned to this buffer so get a free one
		status = get_next_free_filter_number(&filter_number);
	}

	if (eCP_ERR_NONE == status)
	{
		// save the buffer index on the filter to buffer table
		filter_to_cp_buffer[filter_number] = ubBufferIdxV;

		// config filter
		hal_status = can_filter_config(ulIdentifierV, ulAcceptMaskV, ubFormatV, filter_number, fifo_number, 1);

		// try to use booth FIFO in parallel
		if(fifo_number == CAN_FIFO0)
		{
			fifo_number = CAN_FIFO1;
		}
		else
		{
			fifo_number = CAN_FIFO0;
		}

		if (HAL_OK == hal_status)
		{
			return eCP_ERR_NONE;
		}
	}

	return eCP_ERR_INIT_FAIL;
}

/**
 *
 * @return
 */
static CpStatus_tv can_filter_clear_all(void)
{
	HAL_StatusTypeDef hal_status;
	uint8_t i;

	for (i = 0; i < MAX_CAN_FILTER_NUMBER; ++i)
	{
		hal_status = can_filter_config(0, 0, 0, i, CAN_FIFO0, 0);

		if (HAL_OK != hal_status)
		{
			return eCP_ERR_INIT_FAIL;
		}
	}

	return eCP_ERR_NONE;
}

#define CAN_TI0R_STID_BIT_POSITION    ((uint32_t)21)  /* Position of LSB bits STID in register CAN_TI0R */
#define CAN_TI0R_EXID_BIT_POSITION    ((uint32_t) 3)  /* Position of LSB bits EXID in register CAN_TI0R */
#define CAN_TDL0R_DATA0_BIT_POSITION  ((uint32_t) 0)  /* Position of LSB bits DATA0 in register CAN_TDL0R */
#define CAN_TDL0R_DATA1_BIT_POSITION  ((uint32_t) 8)  /* Position of LSB bits DATA1 in register CAN_TDL0R */
#define CAN_TDL0R_DATA2_BIT_POSITION  ((uint32_t)16)  /* Position of LSB bits DATA2 in register CAN_TDL0R */
#define CAN_TDL0R_DATA3_BIT_POSITION  ((uint32_t)24)  /* Position of LSB bits DATA3 in register CAN_TDL0R */

/**
 * @brief  Initiates and transmits a CAN frame message.
 * @param  hcan: pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @param ubBufferIdxV canpie buffer number
 * @param used_tx_mailbox used mailbox for transmit
 * @retval HAL status
 */
static HAL_StatusTypeDef HAL_CAN_Transmit_IT_MOD(CAN_HandleTypeDef* hcan, uint8_t ubBufferIdxV, uint8_t *used_tx_mailbox)
{
	uint32_t transmitmailbox = CAN_TXSTATUS_NOMAILBOX;

	/* Check the parameters */
	assert_param(IS_CAN_IDTYPE(hcan->pTxMsg->IDE));
	assert_param(IS_CAN_RTR(hcan->pTxMsg->RTR));
	assert_param(IS_CAN_DLC(hcan->pTxMsg->DLC));

	if (((hcan->Instance->TSR & CAN_TSR_TME0) == CAN_TSR_TME0) || ((hcan->Instance->TSR & CAN_TSR_TME1) == CAN_TSR_TME1) || ((hcan->Instance->TSR & CAN_TSR_TME2) == CAN_TSR_TME2))
	{
		/* Process Locked */
		__HAL_LOCK(hcan);

		/* Select one empty transmit mailbox */
		if ((hcan->Instance->TSR & CAN_TSR_TME0) == CAN_TSR_TME0)
		{
			transmitmailbox = CAN_TXMAILBOX_0;
		}
		else if ((hcan->Instance->TSR & CAN_TSR_TME1) == CAN_TSR_TME1)
		{
			transmitmailbox = CAN_TXMAILBOX_1;
		}
		else
		{
			transmitmailbox = CAN_TXMAILBOX_2;
		}

		/* Set up the Id */
		hcan->Instance->sTxMailBox[transmitmailbox].TIR &= CAN_TI0R_TXRQ;
		if (hcan->pTxMsg->IDE == CAN_ID_STD)
		{
			assert_param(IS_CAN_STDID(hcan->pTxMsg->StdId));
			hcan->Instance->sTxMailBox[transmitmailbox].TIR |= ((hcan->pTxMsg->StdId << 21U) | hcan->pTxMsg->RTR);
		}
		else
		{
			assert_param(IS_CAN_EXTID(hcan->pTxMsg->ExtId));
			hcan->Instance->sTxMailBox[transmitmailbox].TIR |= ((hcan->pTxMsg->ExtId << 3U) | hcan->pTxMsg->IDE | hcan->pTxMsg->RTR);
		}

		/* Set up the DLC */
		hcan->pTxMsg->DLC &= (uint8_t) 0x0000000F;
		hcan->Instance->sTxMailBox[transmitmailbox].TDTR &= (uint32_t) 0xFFFFFFF0U;
		hcan->Instance->sTxMailBox[transmitmailbox].TDTR |= hcan->pTxMsg->DLC;

		/* Set up the data field */
		hcan->Instance->sTxMailBox[transmitmailbox].TDLR = (((uint32_t) hcan->pTxMsg->Data[3U] << 24U) | ((uint32_t) hcan->pTxMsg->Data[2U] << 16U) | ((uint32_t) hcan->pTxMsg->Data[1U] << 8U)
				| ((uint32_t) hcan->pTxMsg->Data[0U]));
		hcan->Instance->sTxMailBox[transmitmailbox].TDHR = (((uint32_t) hcan->pTxMsg->Data[7U] << 24U) | ((uint32_t) hcan->pTxMsg->Data[6U] << 16U) | ((uint32_t) hcan->pTxMsg->Data[5U] << 8U)
				| ((uint32_t) hcan->pTxMsg->Data[4U]));

		/* Change CAN state */
		switch (hcan->State)
		{
			case (HAL_CAN_STATE_BUSY_RX0):
				hcan->State = HAL_CAN_STATE_BUSY_TX_RX0;
				break;
			case (HAL_CAN_STATE_BUSY_RX1):
				hcan->State = HAL_CAN_STATE_BUSY_TX_RX1;
				break;
			case (HAL_CAN_STATE_BUSY_RX0_RX1):
				hcan->State = HAL_CAN_STATE_BUSY_TX_RX0_RX1;
				break;
			default: /* HAL_CAN_STATE_READY */
				hcan->State = HAL_CAN_STATE_BUSY_TX;
				break;
		}

		/* Set CAN error code to none */
		hcan->ErrorCode = HAL_CAN_ERROR_NONE;

		/* Process Unlocked */
		__HAL_UNLOCK(hcan);

		/* Request transmission */
		hcan->Instance->sTxMailBox[transmitmailbox].TIR |= CAN_TI0R_TXRQ;

		/* save which buffer used on this mailbox */
		used_tx_mailbox[transmitmailbox] = ubBufferIdxV;

		/* Enable Error warning, Error passive, Bus-off,
		 Last error and Error Interrupts */
		__HAL_CAN_ENABLE_IT(hcan, CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR | CAN_IT_TME);
	}
	else
	{
		/* Change CAN state */
		hcan->State = HAL_CAN_STATE_ERROR;

		/* Return function status */
		return HAL_ERROR;
	}

	return HAL_OK;
}

