liebherrnenzing/canpie-fd_device/stm32/f4/hal/stm32f4xx_canpie-fd.c
void HAL_CAN_TxCpltCallback(CAN_HandleTypeDef* hcan)
{
	uint8_t canpie_buffer_number = 0;
	uint32_t clear_flag = 0;

	if (__HAL_CAN_TRANSMIT_STATUS(hcan, CAN_TXMAILBOX_0))
	{
		canpie_buffer_number = tx_mailbox_to_buffer[CAN_TXMAILBOX_0];
		clear_flag = CAN_FLAG_RQCP0;
	}
	// else
	if (__HAL_CAN_TRANSMIT_STATUS(hcan, CAN_TXMAILBOX_1))
	{
		canpie_buffer_number = tx_mailbox_to_buffer[CAN_TXMAILBOX_1];
		clear_flag = CAN_FLAG_RQCP1;
	}
	// else
	if (__HAL_CAN_TRANSMIT_STATUS(hcan, CAN_TXMAILBOX_2))
	{
		canpie_buffer_number = tx_mailbox_to_buffer[CAN_TXMAILBOX_2];
		clear_flag = CAN_FLAG_RQCP2;
	}
//	else
//	{
//		// what should we do here
//		// return and call error callback or ignore because that could not happen
//	}

	if (CPP_NULL != pfnTrmHandlerS)
	{
		pfnTrmHandlerS(&atsCanMsgS[canpie_buffer_number], canpie_buffer_number);
	}

#if CP_STATISTIC > 0
	tx_counter++;
#endif

	__HAL_CAN_CLEAR_FLAG(hcan, clear_flag);

	// Disable Transmit mailbox empty Interrupt
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_TME);

}

void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* hcan)
{
	CpCanMsg_ts *pcan_msg;
	// get filter index
	uint8_t filter_number = hcan->pRxMsg->FMI;
	uint8_t canpie_buffer_number;

	canpie_buffer_number = filter_to_cp_buffer[filter_number];

	pcan_msg = &atsCanMsgS[canpie_buffer_number];

	if (hcan->pRxMsg->IDE == CAN_ID_STD)
	{
		CpMsgSetStdId(pcan_msg, hcan->pRxMsg->StdId);
	}
	else
	{
		CpMsgSetExtId(pcan_msg, hcan->pRxMsg->ExtId);
	}

	if (hcan->pRxMsg->RTR == CAN_RTR_REMOTE)
	{
		CpMsgSetRemote(pcan_msg);
	}
	else
	{
		CpMsgClrRemote(pcan_msg);
	}

	CpMsgSetDlc(pcan_msg, hcan->pRxMsg->DLC);

	pcan_msg->aubData[0] = hcan->pRxMsg->Data[0];
	pcan_msg->aubData[1] = hcan->pRxMsg->Data[1];
	pcan_msg->aubData[2] = hcan->pRxMsg->Data[2];
	pcan_msg->aubData[3] = hcan->pRxMsg->Data[3];
	pcan_msg->aubData[4] = hcan->pRxMsg->Data[4];
	pcan_msg->aubData[5] = hcan->pRxMsg->Data[5];
	pcan_msg->aubData[6] = hcan->pRxMsg->Data[6];
	pcan_msg->aubData[7] = hcan->pRxMsg->Data[7];

	//pcan_msg->ulMsgUser = hcan->pRxMsg->FIFONumber;

	if (CPP_NULL != pfnRcvHandlerS)
	{
		pfnRcvHandlerS(pcan_msg, canpie_buffer_number);
	}

#if CP_STATISTIC > 0
	rx_counter++;
#endif

#if 1
	HAL_CAN_Receive_IT(hcan, hcan->pRxMsg->FIFONumber);
#else
	// FIFO 0 message pending Interrupt
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_FMP0);
	//__HAL_CAN_ENABLE_IT(hcan, CAN_IT_FOV0 | CAN_IT_FMP0);

	// FIFO 1 message pending Interrupt
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_FMP1);
#endif
}

/**
 * @todo enable error callback for error counter
 * @param hcan
 */
void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan)
{
	static CpState_ts state;
	/**@todo fill state */
#if CP_STATISTIC > 0
	err_counter++;
#endif
	/* Enable Error warning, Error passive, Bus-off, Last error and Error Interrupts and FIFO0, FIFO1 */
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR | CAN_IT_TME | CAN_IT_FOV0 | CAN_IT_FMP0 | CAN_IT_FOV1 | CAN_IT_FMP1);

	if (CPP_NULL != pfnErrHandlerS)
	{
		pfnErrHandlerS(&state);
	}
}
